{"meta":{"title":"然小狼的博客","subtitle":"回到最初の梦想，Back to Original Dream","description":"自然代码","author":"Ziran Gong","url":"http://nature1995.club"},"pages":[{"title":"categories","date":"2018-11-10T04:20:17.000Z","updated":"2018-11-10T04:21:53.116Z","comments":false,"path":"categories/index.html","permalink":"http://nature1995.club/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2018-11-10T04:20:11.000Z","updated":"2018-11-10T04:21:53.956Z","comments":false,"path":"tags/index.html","permalink":"http://nature1995.club/tags/index.html","excerpt":"","text":""},{"title":"about","date":"2018-11-10T04:20:22.000Z","updated":"2018-11-13T19:39:58.769Z","comments":true,"path":"about/index.html","permalink":"http://nature1995.club/about/index.html","excerpt":"","text":"龚子然 | Ziran Gong简介教育经历实习经历荣誉与获奖经历能力与技能发表论文研究项目社会经历兴趣Graduate student in Stevens Institute of Technology | 美国斯蒂文斯理工 研究生gzr2008@vip.qq.com | zgong5@stevens.edu我的能力和经验主要集中在通信，Linux，嵌入式，人工智能等领域。教育经历美国斯蒂文斯理工学院Degree: Master of EngineeringMajor: Artificial Intelligence for Electrical and Computer Engineering (AIECE)专业: 人工智能GPA:八月 2018 - 现在北方工业大学，北京，中国学位: 工学学士专业: 通信工程总GPA: 3.45/4.00；专业GPA: 3.67/4.00奖学金:创新实践一等奖学金 2016 - 2017思想品德三等奖学金 2016 - 2017创新实践二等奖学金 2015 - 2016九月 2014 - 七月 2018美国密西西比大学Exchange Study in Electrical Engineering, School of Engineering公派留学交换生GPA: 3.85/4.0八月 2016 - 十二月 2016实习经历思博伦通信科技(北京)有限公司，北京，中国产品验证测试（PV）工程师Python、Tcl编写测试脚本，进行版本功能测试参与了思博伦Landslide产品开发的测试验证，并完成案例配置和测试脚本的开发和维护。一月 2018 - 六月 2018北京裕源大通科技股份有限公司，北京，中国通信网络工程师中国政府六盘水市智能校园项目参与智能灯杆设计，包括广播，监控，报警，Wi-Fi接入等功能。协助团队进行通信设计和规划以及网络优化安装和调试的设备和系统六月 2017 - 八月 2017荣誉与获奖经历思科认证网络工程师（CCNA）Oracle Java认证工程师国家电子行业专业人员认证（嵌入式系统）全国大学生移动通信技术大赛 全国总决赛 一等奖全国大学生移动通信技术大赛 北京市 一等奖第八届蓝桥杯全国信息技术专业人才大赛 嵌入式设计开发 一等奖第九届蓝桥杯全国信息技术专业人才大赛 嵌入式设计开发 二等奖2017年全国大学生电子设计竞赛 三等奖北京大学生光通信产品工程实践大赛 三等奖能力与技能编程语言和工具Skilled in Python, C, JAVA, Shell, TclCapable of STM32, MATLAB, Python, CiscoAbility: Event planning, user experience, 3C product evaluationOthers: 4G Base Station Building &amp; Network Optimizing, 5G, Cloud Computing, Linux Server发表论文龚子然,代勇,王响,王玉花. 基于视觉的室内四旋翼无人机目标追踪系统设计[J]. 仪器仪表用户,2018,25(01):5-8.一月 2018研究项目基于视觉的四旋翼无人机定位系统设计Team Leader, project for the National Undergraduate Electronic Design Contest针对无人机在室内飞行无法依靠GPS定位飞行,还有一些人员无法到达的地点进行关键信息的搜寻工作问题,设计了 一种基于视觉的室内四旋翼无人机目标追踪系统,实现室内定位自主飞行与物体自主识别跟踪功能。May 2017 - August 2017基于UWB的自动舞台灯光系统设计Team Member, Cyber-Physical Systems Lab (Advisor: Dr. Zhengping Li)主要负责MATLAB仿真通过UWB，蓝牙和改进TDOA算法进行定位优化了算法并调试，C语言和MATLAB中编程三月 2017 - 九月 2015基于移动互联网的智能照明控制系统设计Team Member, Lab of Mobile Network Communication Research (Advisor: Dr. Wenle Bai)通过手机和蓝牙实现对灯的开关，颜色和亮度的控制开发了一个Android应用程序，并用C语言编写嵌入式程序三月 2016 - 六月 2016基于Wi-Fi的无线网络定位系统设计Team Member, Cyber-Physical Systems Lab (Advisor: Dr. Zhengping Li)开发了一个Android应用程序，通过信号强度测试和数据库提取实现定位寻找最优定位算法和Wi-Fi信号扫描方法十月 2015 - 十二月 2015基于IOT云平台的室内监控系统设计通过云平台监控实时室内环境和安全通过C和数据库实现基于TCP/IP的客户端和服务器端之间的网络通信三月 2017 - 四月 20173D打印机控制器的设计进行打印机的设计对系统进行了测试和调试，以提高其打印各种物品的精度三月 2015 - 十二月 2015基于MPU6050的飞机姿态测量采用STM32和MPU6050设计系统，实现稳定的飞行和保护用C编程，并通过飞行测试验证数据九月 2015 - 十二月 2015社会经历努比亚（nubia）智能手机 北京同城会会长、社区管理努比亚（nubia）智能手机协调同城会成员，根据品牌发展制定和组织相应的品牌活动。社区论坛日常管理。努荣誉: 努比亚（nubia）年度优秀校园大使，优秀同城会会长十二月 2016 - 八月 2018百度知道 数码类行家百度（Baidu）百度知道行家，解答数码，计算机网络，编程方面问题一月 2016 - 八月 2018兴趣擅长4G/4.5G/5G等相关无线技术，对通信领域有着无限的热爱。喜欢发现和尝试生活中新鲜的事物， 敢于突破自我，力争在最短时间内将目标达成。热爱学习，敢于接受挑战，具备较强的团队合作意识。回到顶部"}],"posts":[{"title":"为什么北美东部冬季经常有暴风雪，而中国冷而少雪？","slug":"为什么北美东部冬季经常有暴风雪，而中国冷而少雪？","date":"2018-11-16T00:48:33.000Z","updated":"2018-11-16T01:20:19.833Z","comments":true,"path":"2018/11/15/为什么北美东部冬季经常有暴风雪，而中国冷而少雪？/","link":"","permalink":"http://nature1995.club/2018/11/15/为什么北美东部冬季经常有暴风雪，而中国冷而少雪？/","excerpt":"学术预警！长文预警！多图预警！北美冬季的气候处于西风带的控制之下，西风带形成了一条很长的高空急流(Jet stream)。这条急流夏天的时候在加拿大北部地区，对美国的气候不造成明显影响，而冬天的时候，急流从美国中间穿过，形成了整个冬季的冷暖气团对峙局面。高空急流形成的原因，高中地理都学过，我就不解释了。美国冬季典型的天气分布是这样的，以今年更为明显。今年冬天整个西部温暖如春，比平均温度高15~25华氏度，东部冰天雪地，比平均温度低15~25华氏度。","text":"学术预警！长文预警！多图预警！北美冬季的气候处于西风带的控制之下，西风带形成了一条很长的高空急流(Jet stream)。这条急流夏天的时候在加拿大北部地区，对美国的气候不造成明显影响，而冬天的时候，急流从美国中间穿过，形成了整个冬季的冷暖气团对峙局面。高空急流形成的原因，高中地理都学过，我就不解释了。美国冬季典型的天气分布是这样的，以今年更为明显。今年冬天整个西部温暖如春，比平均温度高15~25华氏度，东部冰天雪地，比平均温度低15~25华氏度。这条高空急流从太平洋吹过来，在美国西海岸遇到了高山，被推到了高纬度，在华盛顿州的迎风坡造成了大量降水，又一路绕过落基山脉，来到了大平原。大平原地区没有任何山脉的阻挡，急流可以一路南下直到德克萨斯州，最南的时候可以到达佛罗里达州北部。这条急流所在的区域一般约等于0度等温线，所以冬天的时候来冷空气，佛罗里达州北部可能都会产生霜冻灾害。为什么无法再往南推进了，因为墨西哥湾的暖气团太强大了，所以佛罗里达州的南部城市比如迈阿密，从来没有经历过霜冻灾害。拿答主写答案的当前时间为例，北边再冷的时候，佛罗里达州南部都是暖和的，佛罗里达三面环海，完全受到墨西哥湾暖流的控制。（图中深蓝色是0度等温线）与此同时，一场暴风雪正在酝酿中现在的降水不强大，因为没遇到什么水汽。两天后（2015/02/25）当这股降水被吹到北卡罗来纳州，遇到北大西洋暖流带来的的暖气团时，冷暖空气交汇，将会给当地造成暴雪。5~8英寸约等于12到20厘米深的积雪。这对于中国而言，绝对是大暴雪了，美国人民表示见得多了，什么样的大雪没见过？今年一月底东北部的那场大雪，比这个高到不知道哪里去了。好了话说回来。这条高空急流是会经常随意摆动的，当加拿大的极地冷空气势力强的时候，就被推得更南下，当墨西哥湾暖气团势力强的时候，就会被往北推。由于美国东部地形比较平坦，所以高空急流的位移幅度非常大。南则兵临佛罗里达，北则退到缅因州。所以凡是高空急流扫过的地方，都会形成冷锋或暖锋，带来丰富的降水。今年冬天太冷了，所以佛罗里达州雨也下的多了，正常年份是，佛罗里达类似于国内的海南岛，因为冷空气够不着，所以没法形成降水，冬季很干燥。但是美国东海岸越往北，冬季的降水比例越大。以我居住的波士顿为例，一年四季的降水分配情况基本上是平均的，三四月份和十一十二月份降水较多，因为那个时段冷暖交替，被高空急流扫过的频率比较高。今年下雪下疯了，人行道上堆起来的雪太高了，我得跳起来才能看见马路对面……对比一下和波士顿同纬度的中国城市沈阳。在气温上来对比，沈阳冬天比波士顿冷，夏天比波士顿热，气温年较差比较大，因为中国东部的气候比较大陆性，美国东部的气候受到哈得孙湾和五大湖等水体的影响比较海洋性。有趣的是，美国东部的气候在冬天比中国东部要极端的多。看看一月极端最高温度，波士顿是22度，沈阳是8度，波士顿的日极端比日平均高温要高20度，而沈阳只有13度。波士顿的极端低温也比平均低温要低20度，沈阳小一点，17度。生活在中国北方的人都知道，只要河一结冰，开春之前都是不会化的，所以可以放心的冰上走，而美国东北部的河流一般不会整个封冻，冷几天就冻上了，暖几天就化了，除非遇到今年这种特别冷的年份，不敢在冰上走。中国东部的冬天是稳定的，比如沈阳的一月，每天都是最低零下十几度，最高零下几度，但波士顿的一月，有时候最低零下十几度，有时候最低甚至有零上五六度。之所以产生这么大的变化幅度，因为高空急流的位置不同。当高空急流位于南方时，美国东北部就会受到加拿大的极地高压的影响，而高空急流暂时减弱，墨西哥湾暖流占优势时，美国东北部就会受到大西洋的低气压影响。如果这时候突然来了冷空气，就会形成暴风雪。相比，因为中国近海没有暖流，所以中国的东北部几乎一直在西伯利亚-蒙古高压的控制之下，气温稳定而冷，不会出现极端的变化。没有冷暖气团的相遇，就不会形成多少降水，这就是为什么中国北方的冬天干而冷。在中国南方，因为纬度比较低，太阳辐射强，晴天容易升温，遇到冷空气的时候一般就会形成冷锋下雨或者下雪，冬季比较湿冷。但是再怎么湿冷，由于控制中国南方的暖气团势力远远不如墨西哥湾的暖气团强，所以不会形成明显的降水，下雨也只是下小雨，不会出现像夏天一样的暴雨。在中国的东部，冬天影响天气的几乎只有一个变量，那就是有没有冷空气来。如果没有冷空气来，尤其是在黄河以南，天气会随着晴天越来越暖和，直到来一个冷空气大降温，几天的暖和又回到解放前，气温的变化一般是这样的。冷空气来大降温，几天出太阳越来越暖和，直到又来一个冷空气。秋天的时候冷空气的降温更快，太阳晒暖和的速度赶不上，所以越来越冷；春天的时候太阳晒得更快，来一个冷空气倒春寒一下。而美国东部冬天的天气有两个变量影响，不仅要考虑从背面袭来的冷空气，还要考虑从南面袭来的暖空气。这两方打斗不停，所经之处下雨下雪，类似梅雨的形成原因。冷空气控制下冷几天，暖空气控制下暖和几天，反复无常，毫无规律可循。所有直角的地方，基本上都得下雨下雪。暖空气来了就暖锋下雨，冷空气来了就冷锋下雪。在美国东部，尤其是东北部生活的时候你会发现一个现象，就是阴天往往比晴天暖和。因为晴天的时候基本代表高空急流在你南边，高气压控制，冷；阴天的时候基本代表高空急流在你北边，低气压控制，暖。还有一个现象就是，早上比傍晚暖和，或者第二天早上比前一天傍晚暖和。发生这种事的时候，那就是高空急流在移动，扫过你的所在地了。美国东部的冬天气温可以说是完全不受太阳辐射影响，连晒几天太阳并不会明显增温，连下几天雨也不一定会降温。气温完全取决于你的所在地当前是受到什么气团的控制，而气团被高空急流所分割开，所以美国的天气预报别的先不说，先在地图上画一条线，告诉你明天高空急流在哪里，你自己看吧，你在它北边你就冷，你在它南边你就暖和，你被它压着你就很可能下雨下雪。如果是这种情况，那么就是西海岸冷，东海岸暖和，高空急流从南方绕过去，反正一般不会从美国中部山最高的地方穿过去。雷达蓝色的是下雪，绿色的是下雨，这就是一场横扫中部的暴风雪。今年为什么东北部下雪那么多，因为今年的高空急流长期保持这种形状。从西海岸北部穿过，给加拿大西海岸带来充沛降水，然后从中部杀下来，再从沿海走上去。由于盛行西风，当冷空气穿过的时候遇到五大湖的水汽，再遇到北大西洋暖流，在新英格兰地区带来百年一遇的连续的暴风雪。不仅下雪，因为对流太强烈，还会打雷，冬天北方打雷这在中国是无法想象的！最后还得吐槽一句啊，美国的天气预报信息太全面了，The Weather Channel可以显示每时每刻当前全国的气温降水风速分布图等等，中国天气网就没这功能，要看雷达图也只能看一小块局部的，更别说全国当前气温分布图了。中央气象台还得提高姿势水平啊，不要动不动一下雪了就弄个大新闻，跑得比香港记者还快。","categories":[{"name":"Diary","slug":"Diary","permalink":"http://nature1995.club/categories/Diary/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://nature1995.club/tags/随笔/"}]},{"title":"寒假计划NASA之旅","slug":"寒假计划NASA之旅","date":"2018-11-11T01:32:59.000Z","updated":"2018-11-13T23:19:41.079Z","comments":true,"path":"2018/11/10/寒假计划NASA之旅/","link":"","permalink":"http://nature1995.club/2018/11/10/寒假计划NASA之旅/","excerpt":"休斯顿（Houston）德州最大城市，美国第四大城市。提及休斯顿，人们最耳熟能详的莫过于姚明曾效力的NBA火箭队了。然而，在这里，并非只有篮球爱好者才能寻迹自己的梦想，包容、多元的休斯顿也为艺术家们提供了丰富多彩的舞台。","text":"休斯顿（Houston）德州最大城市，美国第四大城市。提及休斯顿，人们最耳熟能详的莫过于姚明曾效力的NBA火箭队了。然而，在这里，并非只有篮球爱好者才能寻迹自己的梦想，包容、多元的休斯顿也为艺术家们提供了丰富多彩的舞台。休斯顿整个城市都充满了浓厚的艺术氛围，无论是露天的音乐派对，还是即兴的街头表演，抑或是剧院和艺术中心演出的芭蕾舞和歌剧……在这里，你随时可以欣赏到高质量的艺术表演。小编本次就带大家开启休斯顿艺术之行。","categories":[{"name":"Diary","slug":"Diary","permalink":"http://nature1995.club/categories/Diary/"}],"tags":[{"name":"游记","slug":"游记","permalink":"http://nature1995.club/tags/游记/"}]},{"title":"Markdown语法","slug":"Markdown语法","date":"2018-11-11T01:21:40.000Z","updated":"2018-11-11T01:26:35.179Z","comments":true,"path":"2018/11/10/Markdown语法/","link":"","permalink":"http://nature1995.club/2018/11/10/Markdown语法/","excerpt":"Markdown语法一级标题二级标题五级标题列表第一项列表第二项","text":"Markdown语法一级标题二级标题五级标题列表第一项列表第二项有序列表第一项有序列表第二项标题 斜体粗体引用段落代码块","categories":[],"tags":[]},{"title":"开始Hexo之旅","slug":"开始Hexo之旅","date":"2018-11-10T04:03:37.000Z","updated":"2018-11-10T04:09:02.210Z","comments":true,"path":"2018/11/09/开始Hexo之旅/","link":"","permalink":"http://nature1995.club/2018/11/09/开始Hexo之旅/","excerpt":"","text":"今天开始部署属于自己的Hexo博客。","categories":[],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://nature1995.club/tags/随笔/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-11-10T02:45:53.640Z","updated":"2018-11-10T02:45:53.640Z","comments":true,"path":"2018/11/09/hello-world/","link":"","permalink":"http://nature1995.club/2018/11/09/hello-world/","excerpt":"","text":"Hello World,Welcome to nature’s blog!","categories":[],"tags":[]}]}